poisellePlacaPlanas/Re-250/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    entrada
    {
        type            patch;
        nFaces          20;
        startFace       3880;
    }
    saida
    {
        type            patch;
        nFaces          20;
        startFace       3900;
    }
    parede
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          100;
        startFace       3920;
    }
    centro
    {
        type            symmetryPlane;
        inGroups        List<word> 1(symmetryPlane);
        nFaces          100;
        startFace       4020;
    }
    zPlan
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          4000;
        startFace       4120;
    }
)

// ************************************************************************* //
