poisellePlacaPlanas/Re-250/system/sampleU
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    location        "system";
    object          sample;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "constant/variaveis"

type sets;
libs ("libsampling.so");
interpolationScheme cellPointFace;

setFormat raw;


sets
(
    linhaA
    {
        type            lineUniform;
        nPoints		$nY;
        axis            y;
        start           ($umLCanal  0        $meiozCanal);
        end             ($umLCanal  $hCanal  $meiozCanal);
    }
    linhaB
    {
        type            lineUniform;
        nPoints		$nY;
        axis            y;
        start           ($doisLCanal  0        $meiozCanal);
        end             ($doisLCanal  $hCanal  $meiozCanal);
    }
    linhaC
    {
        type            lineUniform;
        nPoints		$nY;
        axis            y;
        start           ($tresLCanal  0        $meiozCanal);
        end             ($tresLCanal  $hCanal  $meiozCanal);
    }
    linhaD
    {
        type            lineUniform;
        nPoints		$nY;
        axis            y;
        start           ($finalLCanal  0        $meiozCanal);
        end             ($finalLCanal  $hCanal  $meiozCanal);
    }
);

fields
(
    U
);


// ************************************************************************* //
